Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.29/edc/PIC32MZ1024EFH124.PIC
      <edc:AdjustPoint edc:_addr="0x1F8E3270" edc:offset="4"/>
      <edc:SFRDef edc:_addr="0x1F8E3274" edc:_begin="0x274" edc:_end="0x280" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="14" edc:access="---------------------nnnnnnnnnnn" edc:cname="USBDMA8C" edc:desc="" edc:impl="0x7ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------00000000000" edc:name="USBDMA8C" edc:nzwidth="32" edc:por="---------------------00000000000" ltx:memberofperipheral="USB">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DMAEN" edc:desc="" edc:mask="0x1" edc:name="DMAEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMADIR" edc:desc="" edc:mask="0x1" edc:name="DMADIR" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMAMODE" edc:desc="" edc:mask="0x1" edc:name="DMAMODE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMAIE" edc:desc="" edc:mask="0x1" edc:name="DMAIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMAEP" edc:desc="" edc:mask="0xf" edc:name="DMAEP" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="DMAERR" edc:desc="" edc:mask="0x1" edc:name="DMAERR" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMABRSTM" edc:desc="" edc:mask="0x3" edc:name="DMABRSTM" edc:nzwidth="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E3278" edc:_begin="0x274" edc:_end="0x280" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="14" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="USBDMA8A" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="USBDMA8A" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="USB">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DMAADDR" edc:desc="" edc:mask="0xffffffff" edc:name="DMAADDR" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E327C" edc:_begin="0x274" edc:_end="0x280" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="14" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="USBDMA8N" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="USBDMA8N" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="USB">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DMACOUNT" edc:desc="" edc:mask="0xffffffff" edc:name="DMACOUNT" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8E3280" edc:offset="132"/>
      <edc:SFRDef edc:_addr="0x1F8E3304" edc:_begin="0x304" edc:_end="0x320" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="15" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="USBE1RPC" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="USBE1RPC" edc:nzwidth="32" edc:por="----------------0000000000000000" ltx:memberofperipheral="USB">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RQPKTCNT" edc:desc="" edc:mask="0xffff" edc:name="RQPKTCNT" edc:nzwidth="16"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E3308" edc:_begin="0x304" edc:_end="0x320" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="15" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="USBE2RPC" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="USBE2RPC" edc:nzwidth="32" edc:por="----------------0000000000000000" ltx:memberofperipheral="USB">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RQPKTCNT" edc:desc="" edc:mask="0xffff" edc:name="RQPKTCNT" edc:nzwidth="16"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E330C" edc:_begin="0x304" edc:_end="0x320" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="15" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="USBE3RPC" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="USBE3RPC" edc:nzwidth="32" edc:por="----------------0000000000000000" ltx:memberofperipheral="USB">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RQPKTCNT" edc:desc="" edc:mask="0xffff" edc:name="RQPKTCNT" edc:nzwidth="16"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E3310" edc:_begin="0x304" edc:_end="0x320" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="15" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="USBE4RPC" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="USBE4RPC" edc:nzwidth="32" edc:por="----------------0000000000000000" ltx:memberofperipheral="USB">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RQPKTCNT" edc:desc="" edc:mask="0xffff" edc:name="RQPKTCNT" edc:nzwidth="16"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E3314" edc:_begin="0x304" edc:_end="0x320" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="15" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="USBE5RPC" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="USBE5RPC" edc:nzwidth="32" edc:por="----------------0000000000000000" ltx:memberofperipheral="USB">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RQPKTCNT" edc:desc="" edc:mask="0xffff" edc:name="RQPKTCNT" edc:nzwidth="16"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E3318" edc:_begin="0x304" edc:_end="0x320" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="15" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="USBE6RPC" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="USBE6RPC" edc:nzwidth="32" edc:por="----------------0000000000000000" ltx:memberofperipheral="USB">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RQPKTCNT" edc:desc="" edc:mask="0xffff" edc:name="RQPKTCNT" edc:nzwidth="16"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E331C" edc:_begin="0x304" edc:_end="0x320" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="15" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="USBE7RPC" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="USBE7RPC" edc:nzwidth="32" edc:por="----------------0000000000000000" ltx:memberofperipheral="USB">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RQPKTCNT" edc:desc="" edc:mask="0xffff" edc:name="RQPKTCNT" edc:nzwidth="16"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
